Tekla Open API Reference for Tekla Structures 2025
DrawingPluginBase.InputDefinition Constructor (Identifier, List<Point>)
 Creates a new input definition with multiple points.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public InputDefinition(
	Identifier viewId,
	List<Point> points
)
Public Sub New (
	viewId As Identifier,
	points As List(Of Point)
)
Parameters
viewId
Type: Tekla.Structures.Identifier
The view identifier.
points
Type: System.Collections.Generic.List<Point>
The points.
See Also
Reference
DrawingPluginBase.InputDefinition Class
DrawingPluginBase.InputDefinition Overload
Tekla.Structures.Plugins Namespace